using System;
using System.Runtime.InteropServices;

namespace POSTMiniDump
{
    public class Data
    {
        public const ulong DUMP_MAX_SIZE = 0x0c800000;
        public const ulong SIZE_OF_HEADER = 32;
        public const ulong SIZE_OF_DIRECTORY = 12;
        public const uint PROCESS_PARAMETERS_OFFSET = 0x20;
        public const uint OSMAJORVERSION_OFFSET = 0x118;
        public const uint OSMINORVERSION_OFFSET = 0x11c;
        public const uint OSBUILDNUMBER_OFFSET = 0x120;
        public const uint OSPLATFORMID_OFFSET = 0x124;
        public const ulong SIZE_OF_SYSTEM_INFO_STREAM = 48;
        public const ulong SIZE_OF_MINIDUMP_MODULE = 108;
        public const uint CSDVERSION_OFFSET = 0x2e8;
        public const uint PEB_OFFSET = 0x60;
        public const uint MINIDUMP_SIGNATURE = 0x504d444d;
        public const uint MINIDUMP_VERSION = 42899;
        public const ushort MINIDUMP_IMPL_VERSION = 0;
        public const uint LDR_POINTER_OFFSET = 0x18;
        public const uint MODULE_LIST_POINTER_OFFSET = 0x20;
        public const int MAX_PATH = 260;


        public class dump_context
        {
            public IntPtr hProcess;
            public IntPtr BaseAddress;
            public long rva;
            public ulong DumpMaxSize;
            public uint Signature;
            public uint Version;
            public ushort ImplementationVersion;
        }

        public class MiniDumpMemoryDescriptor64
        {

            [FieldOffset(0)] public uint LowPartAsUInt;

            [FieldOffset(4)] public int HighPartAsInt;
            [FieldOffset(4)] public uint HighPartAsUInt;
        }


        [StructLayout(LayoutKind.Sequential, CharSet = CharSet.Unicode)]
        public struct ACTIVATION_CONTEXT
        {
            public int cbSize;
            public uint dwFlags;
            public Data.UNICODE_STRING lpSource;
            public UInt16 wProcessorArchitecture;
            public UInt16 wLangId;
            public Data.UNICODE_STRING lpAssemblyDirectory;
            public IntPtr lpResourceName;
            public Data.UNICODE_STRING lpApplicationName;
            public IntPtr hModule;
        }

        [StructLayout(LayoutKind.Explicit)]
        public unsafe struct IMAGE_IMPORT_DESCRIPTOR
        {
            [FieldOffset(0)]
            public uint Characteristics;

            [FieldOffset(0)]
            public uint OriginalFirstThunk;

            [FieldOffset(4)]
            public uint TimeDateStamp;

            [FieldOffset(8)]
            public uint ForwarderChain;

            [FieldOffset(12)]
            public uint Name;

            [FieldOffset(16)]
            public uint FirstThunk;
        }

        [StructLayout(LayoutKind.Sequential, CharSet = CharSet.Unicode)]
        public unsafe struct LDRP_LOAD_CONTEXT
        {
            public UNICODE_STRING BaseDllName;
            public void* somestruct;
            public uint Flags;
            public NTSTATUS* pstatus;
            public LDR_DATA_TABLE_ENTRY* ParentEntry; 
            public LDR_DATA_TABLE_ENTRY* Entry; 
            public LIST_ENTRY WorkQueueListEntry;
            public LDR_DATA_TABLE_ENTRY* ReplacedEntry;
            public LDR_DATA_TABLE_ENTRY** pvImports;
            public uint ImportDllCount;
            public int TaskCount;
            public void* pvIAT;
            public uint SizeOfIAT;
            public uint CurrentDll;
            public IMAGE_IMPORT_DESCRIPTOR piid;
            public uint OriginalIATProtect;
            public void* GuardCFCheckFunctionPointer;
            public void* pGuardCFCheckFunctionPointer;
        };
        
        [StructLayout(LayoutKind.Sequential)]
        public struct LIST_ENTRY
        {
            public IntPtr Flink;
            public IntPtr Blink;
        }
        
        public unsafe struct LDR_SERVICE_TAG_RECORD
        {
            public LDR_SERVICE_TAG_RECORD* Next;
            public uint ServiceTag; 
        }

        public unsafe struct SINGLE_LIST_ENTRY
        {
            public SINGLE_LIST_ENTRY* Next;
        }

        public unsafe struct LDRP_CSLIST
        {
            public SINGLE_LIST_ENTRY* Tail;
        }


        [StructLayout(LayoutKind.Explicit)]
        public unsafe struct LDR_DDAG_NODE
        {
            [FieldOffset(0x00)]
            public LIST_ENTRY Modules;

            [FieldOffset(0x8)]
            public LDR_SERVICE_TAG_RECORD* ServiceTagList;

            [FieldOffset(0xc)]
            public uint LoadCount;

            [FieldOffset(0x10)]
            public uint ReferenceCount;

            [FieldOffset(0x14)]
            public uint DependencyCount;

            [FieldOffset(0x18)]
            public LDRP_CSLIST Dependencies;

            [FieldOffset(0x18)]
            public SINGLE_LIST_ENTRY RemovalLink;

            [FieldOffset(0x1c)]
            public LDRP_CSLIST IncomingDependencies;

            [FieldOffset(0x20)]
            public LDR_DDAG_STATE State;

            [FieldOffset(0x24)]
            public SINGLE_LIST_ENTRY CondenseLink;

            [FieldOffset(0x28)]
            public uint PreorderNumber;

            [FieldOffset(0x2c)]
            public uint LowestLink;
        }

        [StructLayout(LayoutKind.Explicit)]
        public unsafe struct RTL_BALANCED_NODE
        {
            [FieldOffset(0x00)]
            public RTL_BALANCED_NODE* Children;

            [FieldOffset(0x00)]
            public RTL_BALANCED_NODE* left;

            [FieldOffset(0x08)]
            public RTL_BALANCED_NODE* Right;

            [FieldOffset(0x10)]
            public char Red;

            [FieldOffset(0x10)]
            public char Balance;

            [FieldOffset(0x10)]
            public ulong ParentValue;
        }
       
        public unsafe struct LDR_DATA_TABLE_ENTRY
        {
            public LIST_ENTRY InMemoryOrderLinks;
            public LIST_ENTRY InInitializationOrderList;
            public IntPtr DllBase;
            public IntPtr EntryPoint;
            public uint SizeOfImage;
            public UNICODE_STRING FullDllName;
            public UNICODE_STRING BaseDllName;
            public fixed char Flags[2];
            public short ObsoleteLoadCount;
            public short TlsIndex;
            public LIST_ENTRY HashLinks;
            public uint TimeDateStamp;
            private uint Reserved;
            public ACTIVATION_CONTEXT* EntryPointActivationContext;
            public IntPtr Lock;
            public LDR_DDAG_NODE* DdagNode;
            public LIST_ENTRY NodeModuleLink;
            public LDRP_LOAD_CONTEXT* LoadContext;
            public IntPtr ParentDllBase;
